# Replace real data to random data to use it in portfolio

#### Import libraries needed

In [1]:
import numpy as np
import pandas as pd
import random

#### Create a function that replaces a column with real data with a random data from a list
#### If the column has related columns in other tables, they can also be replaced by adding a list of the columns in the third parameter

In [2]:
def replace_column_values(column_name,replaced_list,related_columns=None):
    #Get unique values from the main column in which the values will be replaced
    get_unique_values = column_name.dropna().unique().tolist()
    #Get the size of the list to find matching list
    size_of_column_list = len(get_unique_values)
    #get the replaced list to be the same size than the unique values in the column
    replaced_list = replaced_list[:size_of_column_list]
    #replace the column with the list
    column_name.replace(get_unique_values,replaced_list,inplace=True)
 
    #If there are related columns, replace the matching values with the same list provided earlier
    if related_columns:
        for column in related_columns:
            column.replace(get_unique_values,replaced_list,inplace=True)

#### Read the main table to a dataframe

In [3]:
df_final = pd.read_excel("/media/ahmed/1A1B48F4515C9371/data/projects/PowerBIPortfolio/StudentsPerformanceWithRandomData/Final5AllSubjects.xlsx")

### First we need to replace the names in the dataframes to random names
#### Read the related table to a dataframe

In [4]:
df_midterm = pd.read_excel("/media/ahmed/1A1B48F4515C9371/data/projects/PowerBIPortfolio/StudentsPerformanceWithRandomData/Midterm5AllSubjects.xlsx")

In [5]:
df_final.columns

Index(['StudentID', 'Name', 'Subject', 'Class', 'Activity', 'Short Evaluation',
       'Assignments', 'Behaviour', 'Art Activities', 'Participation',
       'Project', 'Practical Exam', 'Achivements', 'Period', 'Main Evaluation',
       '2nd Attempt', 'Grade', 'Status'],
      dtype='object')

In [6]:
df_midterm.columns

Index(['StudentID', 'Name', 'Subject', 'Class', 'Period', 'Main Evaluation',
       'Grade', 'Status'],
      dtype='object')

#### Read the dataset which contains the random data

In [7]:
names = pd.read_csv("/media/ahmed/1A1B48F4515C9371/data/projects/moepowerbi/randomizedata/archive/Customer_Names.csv")
names

     First Name Last Name
0      Mechelle  Stoneman
1        Tyesha   Freitag
2          Dean  Stoecker
3       Annelle   Pickney
4     Margareta      Tacy
...         ...       ...
1995       Myrl   Eriksen
1996      Oleta     Moret
1997     Carita   Fifield
1998      Glory   Mckeown
1999     Hallie     Joshi

[2000 rows x 2 columns]

#### Prepare the names list that will be replaced with and display a sample

In [8]:
names["Full Name"] = names["First Name"]+" "+names["Last Name"]
names

     First Name Last Name          Full Name
0      Mechelle  Stoneman  Mechelle Stoneman
1        Tyesha   Freitag     Tyesha Freitag
2          Dean  Stoecker      Dean Stoecker
3       Annelle   Pickney    Annelle Pickney
4     Margareta      Tacy     Margareta Tacy
...         ...       ...                ...
1995       Myrl   Eriksen       Myrl Eriksen
1996      Oleta     Moret        Oleta Moret
1997     Carita   Fifield     Carita Fifield
1998      Glory   Mckeown      Glory Mckeown
1999     Hallie     Joshi       Hallie Joshi

[2000 rows x 3 columns]

In [9]:
fullnames = names["Full Name"].values.tolist()
fullnames[0:20]

['Mechelle Stoneman',
 'Tyesha Freitag',
 'Dean Stoecker',
 'Annelle Pickney',
 'Margareta Tacy',
 'Meghann Placencia',
 'Kendrick Cieslak',
 'Polly Isenberg',
 'Evelyne Racicot',
 'Augustus Delaune',
 'Shawanda Client',
 'Loura Coffield',
 'Lorriane Machin',
 'Lacey Osier',
 'Nicki Malchow',
 'Sidney Bodiford',
 'Barbie Cun',
 'Elden Hanshaw',
 'Blossom Loggins',
 'Joseph Dennie']

#### Use the function created above to replace the name column in the dataframe and the related name column in the second dataframe

In [10]:
replace_column_values(df_final["Name"],fullnames,[df_midterm["Name"]])

### Secondly we need to replace student IDs with random IDs
#### Get the number of students who we have

In [11]:
student_list = df_final["StudentID"].unique().tolist()
len(student_list)

380

#### Get random numbers with the same size as the list we have and display a sample

In [12]:
rand_numbers = []
while len(rand_numbers) < len(student_list):
    new_rand_number = random.randint(11111111111, 99999999999)
    if new_rand_number not in rand_numbers:
        rand_numbers.append(new_rand_number)
        
rand_numbers[0:20]

[39529582068,
 37611633147,
 30668199483,
 65607139037,
 45817080838,
 89458419336,
 84026078295,
 35003064543,
 61095347501,
 55834569909,
 87853781687,
 92073204821,
 37859965645,
 37503043720,
 12686316387,
 88904633586,
 13113220439,
 50684951269,
 13552444688,
 78452664067]

#### Use the function created above to replace the StudentID column in the dataframe and the related name column in the second dataframe

In [13]:
replace_column_values(df_final["StudentID"],rand_numbers,[df_midterm["StudentID"]])

#### Display a sample of both tables after data replacement

In [14]:
df_final.head()

,StudentID,Name,Subject,Class,Activity,Short Evaluation,Assignments,Behaviour,Art Activities,Participation,Project,Practical Exam,Achivements,Period,Main Evaluation,2nd Attempt,Grade,Status
0,39529582068,Mechelle Stoneman,Mathematics,05/1,50.0,20.0,10.0,NaN,NaN,5.0,15.0,NaN,NaN,1st Term Final,46.0,NaN,38.0,Present
1,37611633147,Tyesha Freitag,Mathematics,05/1,50.0,20.0,10.0,NaN,NaN,5.0,15.0,NaN,NaN,1st Term Final,42.5,NaN,36.5,Present
2,30668199483,Dean Stoecker,Mathematics,05/1,50.0,20.0,10.0,NaN,NaN,5.0,15.0,NaN,NaN,1st Term Final,27.0,NaN,28.5,Present
3,65607139037,Annelle Pickney,Mathematics,05/1,50.0,20.0,10.0,NaN,NaN,5.0,15.0,NaN,NaN,1st Term Final,43.0,NaN,37.0,Present
4,45817080838,Margareta Tacy,Mathematics,05/1,50.0,20.0,10.0,NaN,NaN,5.0,15.0,NaN,NaN,1st Term Final,47.0,NaN,37.0,Present

In [15]:
df_midterm.head()

,StudentID,Name,Subject,Class,Period,Main Evaluation,Grade,Status
0,39529582068,Mechelle Stoneman,Mathematics,05/1,1st Midterm,29.0,14.5,Present
1,37611633147,Tyesha Freitag,Mathematics,05/1,1st Midterm,28.5,14.5,Present
2,30668199483,Dean Stoecker,Mathematics,05/1,1st Midterm,24.5,12.5,Present
3,65607139037,Annelle Pickney,Mathematics,05/1,1st Midterm,29.0,14.5,Present
4,45817080838,Margareta Tacy,Mathematics,05/1,1st Midterm,26.0,13.0,Present

#### Export data to Excel to be used instead of previous data

In [16]:
df_final.to_excel("final.xlsx")

In [17]:
df_midterm.to_excel("midterm.xlsx")